// Загрузка и настройка переменных окружения из файла.env
require("dotenv").config({ path: __dirname + "/.env" });

// Импорт встроенного модуля http для создания HTTP-сервера
const http = require("http");

// Импорт основного приложения Express.js, содержащего все маршруты и логику обработки запросов
const app = require("./app");

// Импорт объекта logger для логирования информации о работе приложения
const { logger } = require("./utils/logger");

// Создание HTTP-сервера с использованием функции createServer модуля http и передача ему экземпляра приложения Express.js в качестве обработчика запросов
const server = http.createServer(app);

// Определение порта, на котором будет работать сервер. Используется переменная окружения PORT, если она установлена; в противном случае используется порт 8080
const PORT = process.env.PORT || 8080;

// Запуск сервера на указанном порте и вызов функции обратного вызова после успешного запуска, которая использует logger для записи сообщения в журнал, подтверждающего, что сервер работает на определенном порту
server.listen(PORT, () => logger.info(`Magic happening on port: ${PORT}`));
